org-files/docker.org
:PROPERTIES:
:ID:       de7aa47f-2138-470f-a412-977c1cf3d42c
:END:
#+title: docker
#+STARTUP: overview
#+date: <2023-08-30>

[[https://www.docker.com][Docker]] es un proyecto de código abierto que automatiza el despliegue de aplicaciones dentro de contenedores de software, proporcionando una capa adicional de abstracción y automatización de virtualización de aplicaciones en múltiples sistemas operativos.

*** Instalación
#+BEGIN_SRC bash
curl -fsSL https://get.docker.com -o get-docker.sh
chmod u+x get-docker.sh
sudo ./get-docker.sh
sudo usermod -aG docker $(whoami)
#+END_SRC
**** Ejecutar sin sudo
#+begin_src bash
sudo groupadd docker
sudo usermod -aG docker <usuario>
su - <usuario>
#+end_src
*** Comandos básicos
 - Formatear la salida (json) -> ~comando --format '{{ json . }}' | jq~
 - Parar un contenedor - docker stop xxxxxxxxx
 - Parar todos contenedores - docker stop `docker ps -q`
 - Listar todos contenedores - ~docker container ls~
 - Lanzar un docker-compose.yml -> ~docker compose up~
 - Lanzar un docker-compose.yml (Segundo plano) -> ~docker compose up -d~

**** Sistema
 - Obtener info del sistema -> ~docker system info --format 'El número de CPU es: {{ .NCPU }}'~
 - Obtener info del sistema (json) -> ~docker system info --format '{{ json .}}' | jq~
 - Estadísticas (Instantáneas) -> ~docker container stats --no-stream~
 - Estadísticas (Tiempo real) -> ~docker container stats~
 - Espacio usado -> ~docker system df~

**** Imágenes
 - Descargar -> ~docker image pull <imagen>
 - Listar (Todas) -> ~docker image ls~
 - Listar (filtro) -> ~docker image list filtro~
 - Borrar (Todas) -> ~docker rmi -f $(docker images -q)~
 - Buscar -> ~docker search nginx~
 - Inspeccionar -> ~docker image inspect hello-world --format '{{ json .Config }}' | jq~

**** Contenedores
 - Listar (Todos que están corriendo) -> ~docker container ls~
 - Listar (Todos) -> ~docker container ls --all~
 - Borrar -> ~docker container rm id~
 - Borrar (Todos) -> ~docker rm -f $(docker ps -aq)~
 - Borrar (Todos forzando) -> ~docker container rm -f $(docker container ls -aq)~
 - Arranque en modo interactivo -> ~docker container run -it <imagen>~
 - Arranque desacoplado -> ~docker container run --detach <imagen>~ (o tambien ~-d~)
 - Parar un contenedor -> ~docker container stop~
 - Consultar log y esperar -> ~docker container logs --follow <contenedor>~
 - Consultar log -> ~docker container logs <contenedor>~
 - Consultar log (parámetros) -> ~-since~ (Desde), ~-tail~ (Ultimos), ~-until~ (Hasta)
 - IP asignada -> ~docker container inspect <id> --format '{{ json .NetworkSettings.Networks.bridge.IPAddress }}'~

**** Redes
 - Listar -> ~docker network ls~
 - Inspeccionar -> ~docker network inspect <nombre>~
 - Contenedores conectados a red -> ~docker network inspect bridge --format='{{ json .Containers }}'~
 - Crear nueva red "bridge" -> ~docker network create --driver bridge <nombre>~
 - Eliminar una red -> ~docker network rm <nombre>~
   
**** Otros



 
